[
  { 
      "_id": "A101", 
      "title": "Propulsion Assignment", 
      "course": "RS101",
      "description": "Analyze different propulsion systems and their applications in modern aerospace engineering. Include calculations and theoretical explanations."
  },
  { 
      "_id": "A102", 
      "title": "Combustion Analysis", 
      "course": "RS101",
      "description": "Study the combustion process in rocket engines, focusing on fuel efficiency, burn rates, and the chemical reactions involved."
  },
  { 
      "_id": "A103", 
      "title": "Nozzle Design Project", 
      "course": "RS101",
      "description": "Design a nozzle for a rocket engine, considering factors such as material selection, thermal stresses, and performance optimization."
  },
  { 
      "_id": "A201", 
      "title": "Aerodynamics Quiz", 
      "course": "RS102",
      "description": "Answer multiple-choice and short-answer questions on key aerodynamic principles, including lift, drag, and airflow characteristics."
  },
  { 
      "_id": "A202", 
      "title": "Flow Analysis", 
      "course": "RS102",
      "description": "Perform a detailed analysis of fluid flow over various airfoil shapes, using computational fluid dynamics (CFD) tools."
  },
  { 
      "_id": "A203", 
      "title": "Heating Analysis", 
      "course": "RS102",
      "description": "Investigate the thermal effects on aerospace structures during high-speed flight, including heat transfer and material response."
  },
  { 
      "_id": "A301", 
      "title": "Structural Design Task", 
      "course": "RS103",
      "description": "Design and analyze the structural components of an aerospace vehicle, focusing on stress distribution and material selection."
  },
  { 
      "_id": "A302", 
      "title": "Orbital Calculations", 
      "course": "RS103",
      "description": "Calculate the orbital parameters for a satellite, including launch requirements, orbital transfer maneuvers, and station-keeping strategies."
  },
  { 
      "_id": "A303", 
      "title": "Systems Engineering Exam", 
      "course": "RS103",
      "description": "Complete a comprehensive exam covering the principles of systems engineering, including requirements analysis, system design, and integration testing."
  }
]
